> # extra y
> compare(list("a", "b"), list("a", "b", "c"))
* `x[[3]]` should be a character vector, not absent

> compare(list(a = "a", b = "b"), list(a = "a", b = "b", c = "c"))
* `names(x)`: 2a3
* `x$c` should be a character vector, not absent

> # extra x
> compare(list("a", "b", "c"), list("a", "b"))
* `x[[3]]` should be absent, not a character vector

> compare(list(a = "a", b = "b", c = "c"), list(a = "a", b = "b"))
* `names(x)`: 3d2
* `x$c` should be absent, not a character vector

> # different order
> compare(list(a = "a", b = "b"), list(b = "b", a = "a"))
* `names(x)`: 1d0 2a2

> # invalid names uses position
> compare(list(a = "a", "b"), list(a = "a", "c"))
* `x[[2]]`: 1c1

> compare(list(a = "a", a = "b"), list(a = "a", a = "c"))
* `x[[2]]`: 1c1

