> # extra y
> compare(list("a", "b"), list("a", "b", "c"))
x `x[[3]]` should be a character vector ('c'), not absent

> compare(list(a = "a", b = "b"), list(a = "a", b = "b", c = "c"))
x `x$c` should be a character vector ('c'), not absent
x `names(x)`: 'a' 'b' +'c'

> # extra x
> compare(list("a", "b", "c"), list("a", "b"))
x `x[[3]]` should be absent, not a character vector ('c')

> compare(list(a = "a", b = "b", c = "c"), list(a = "a", b = "b"))
x `x$c` should be absent, not a character vector ('c')
x `names(x)`: 'a' 'b' -'c'

> # different order
> compare(list(a = "a", b = "b"), list(b = "b", a = "a"))
x `names(x)`: -'a' 'b' +'a'

> # invalid names uses position
> compare(list(a = "a", "b"), list(a = "a", "c"))
x `x[[2]]`: 'b'/'c'

> compare(list(a = "a", a = "b"), list(a = "a", a = "c"))
x `x[[2]]`: 'b'/'c'

